/*	****************************************************************************
	Project	:	Pointer's in C-program
	Data	:	06.02.2026
	Desript	:	Программы с аргументами в командной строке. Как можно выбрать
реализации программы
***************************************************************************** */


/*	набор вставляемых файлов: стандартные или пользовательские библиотеки	*/
#include  <stdio.h>
//====================================================================


/*	внешние переменные и объявление функций	*/
//====================================================================


/*	основная программа.	
	argc - кол-во аргументов в командной строке;
	argv -  массив аргументов в виде символов.
*/
int	main( int argc, char *argv[]){
	if(argc < 1){
		printf("Not find attribute. \n"); 
		return 0;
	}
	
	printf("Number of argument: %d\n", argc);
	for(int i = 1; i < argc; i++){
		printf("%s%s", argv[i], (i < argc-1) ? " " : "");
	}
	printf("\n");
	return 0;
}
//====================================================================