/*	Project	:	extern variable & func inside C-program
	StartDate:	01.02.2026
	Desription:	Пример работы с внешними переменными и функциями. Макроподстановки.
Обмен данных между функциями через аргументы.
*/
//====================================================================


/*	набор вставляемых файлов: стандартные или пользовательские библиотеки	*/
#include  <stdio.h>
#define		MAX_SYMB	100
//====================================================================


/*	внешние переменные и объявление функций	*/
void	symb_enter (char o_symb[]);				//через аргумент "o_symb" функция поделится символами с программой.
//====================================================================


/*	заглавная функция	*/
void	main( ){
	char	in_symb[MAX_SYMB];
	//**********************************

	printf("Hello! I'm main_func: \n");
	symb_enter ( in_symb );
	printf("\t%s \n",in_symb);
	
}
//====================================================================


/*	Ввод символов из консоли. Передача массива в main в виде аргумента. */
void	symb_enter (char o_symb[]) {
	char 	arr[MAX_SYMB];
	int		symb;	
	int		i = 0;
	//**********************************
	
	printf("Enter serial symbols: ");
	while( (i<MAX_SYMB-1) && ((symb = getchar()) != EOF) ){
		if(symb == '\n') break;
		arr[i++] = symb;
	}
	printf("symb_enter:: i==%d. \n", i);
	arr[i] = '\0';
	
	for(i=0; ((i<MAX_SYMB) && (arr[i]!='\0')); ++i){
		o_symb[i] = arr[i];
	}
}
//====================================================================