/*	****************************************************************************
	Project	:	Pointer's in C-program
	Data	:	06.02.2026
	Desript	:	Что такое указатель? Указатель и массив. Указатель как аргумент.
Указатель как возврат функции.
***************************************************************************** */


/*	набор вставляемых файлов: стандартные или пользовательские библиотеки	*/
#include  <stdio.h>
//====================================================================


/*	внешние переменные и объявление функций	*/
void	change (int *pa);		//функция меняет переменные в программе без создания копий.
int		*retu_func ()
//====================================================================



/*	Основная программа */
void	main(){
	int 	*ptr;			//объявление указателя
	int		var1 = 10;		//определение переменной
	//----------------------------------
	
	ptr = &var1;
	printf("Hello! I'm program with pointers. \n");
	printf("Var1 = %d. *ptr = %d. ptr = %d. \n", var1, *ptr, ptr);
	printf("Func \"change\". \n");
	change(&var1);
	printf("Var1 = %d. *ptr = %d. ptr = %d. \n", var1, *ptr, ptr);
	
}
//====================================================================


/* Указатель как аргумент */
void change (int *pa){
	*pa += 25;
}
//====================================================================
