/*	****************************************************************************
	Project	:	Struct in C-program
	Data	:	06.02.2026
	Desript	:	Работа со структурами в программе Си.
***************************************************************************** */


/*	набор вставляемых файлов: стандартные или пользовательские библиотеки	*/
#include  	<stdio.h>
#include	"struct_type.c"
#define		LOGIN_MAX	10
//====================================================================



/*	внешние переменные и объявление функций	*/
//====================================================================



/* Главная программа */
void	main(){
	st_type( );
}
//====================================================================